Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/edc/PIC32MZ1024EFM064.PIC
      <edc:DCRDef edc:_addr="0x1FC2FF44" edc:access="-n-----------nnn-nnnnnnnnnnn-nnn" edc:cname="AUBADEVCFG2" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x40077ff7" edc:name="AUBADEVCFG2" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xffffffff">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FPLLIDIV" edc:desc="System PLL Input Divider" edc:mask="0x7" edc:name="FPLLIDIV" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="DIV_1" edc:desc="1x Divider" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="DIV_2" edc:desc="2x Divider" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DIV_3" edc:desc="3x Divider" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DIV_4" edc:desc="4x Divider" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DIV_5" edc:desc="5x Divider" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DIV_6" edc:desc="6x Divider" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="DIV_7" edc:desc="7x Divider" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="DIV_8" edc:desc="8x Divider" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="FPLLRNG" edc:desc="System PLL Input Range" edc:mask="0x7" edc:name="FPLLRNG" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="RANGE_BYPASS" edc:desc="Bypass" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="RANGE_5_10_MHZ" edc:desc="5-10 MHz Input" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="RANGE_8_16_MHZ" edc:desc="8-16 MHz Input" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="RANGE_13_26_MHZ" edc:desc="13-26 MHz Input" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="RANGE_21_42_MHZ" edc:desc="21-42 MHz Input" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="RANGE_34_68_MHZ" edc:desc="34-68 MHz Input" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FPLLICLK" edc:desc="System PLL Input Clock Selection" edc:mask="0x1" edc:name="FPLLICLK" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="PLL_FRC" edc:desc="FRC is input to the System PLL" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PLL_POSC" edc:desc="POSC is input to the System PLL" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FPLLMULT" edc:desc="System PLL Multiplier" edc:mask="0x7f" edc:name="FPLLMULT" edc:nzwidth="7">
              <edc:DCRFieldSemantic edc:cname="MUL_1" edc:desc="PLL Multiply by 1" edc:when="(field &amp; 0x7F) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="MUL_2" edc:desc="PLL Multiply by 2" edc:when="(field &amp; 0x7F) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="MUL_3" edc:desc="PLL Multiply by 3" edc:when="(field &amp; 0x7F) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="MUL_4" edc:desc="PLL Multiply by 4" edc:when="(field &amp; 0x7F) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="MUL_5" edc:desc="PLL Multiply by 5" edc:when="(field &amp; 0x7F) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="MUL_6" edc:desc="PLL Multiply by 6" edc:when="(field &amp; 0x7F) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="MUL_7" edc:desc="PLL Multiply by 7" edc:when="(field &amp; 0x7F) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="MUL_8" edc:desc="PLL Multiply by 8" edc:when="(field &amp; 0x7F) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="MUL_9" edc:desc="PLL Multiply by 9" edc:when="(field &amp; 0x7F) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="MUL_10" edc:desc="PLL Multiply by 10" edc:when="(field &amp; 0x7F) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="MUL_11" edc:desc="PLL Multiply by 11" edc:when="(field &amp; 0x7F) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="MUL_12" edc:desc="PLL Multiply by 12" edc:when="(field &amp; 0x7F) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="MUL_13" edc:desc="PLL Multiply by 13" edc:when="(field &amp; 0x7F) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="MUL_14" edc:desc="PLL Multiply by 14" edc:when="(field &amp; 0x7F) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="MUL_15" edc:desc="PLL Multiply by 15" edc:when="(field &amp; 0x7F) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="MUL_16" edc:desc="PLL Multiply by 16" edc:when="(field &amp; 0x7F) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="MUL_17" edc:desc="PLL Multiply by 17" edc:when="(field &amp; 0x7F) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="MUL_18" edc:desc="PLL Multiply by 18" edc:when="(field &amp; 0x7F) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="MUL_19" edc:desc="PLL Multiply by 19" edc:when="(field &amp; 0x7F) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="MUL_20" edc:desc="PLL Multiply by 20" edc:when="(field &amp; 0x7F) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="MUL_21" edc:desc="PLL Multiply by 21" edc:when="(field &amp; 0x7F) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="MUL_22" edc:desc="PLL Multiply by 22" edc:when="(field &amp; 0x7F) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="MUL_23" edc:desc="PLL Multiply by 23" edc:when="(field &amp; 0x7F) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="MUL_24" edc:desc="PLL Multiply by 24" edc:when="(field &amp; 0x7F) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="MUL_25" edc:desc="PLL Multiply by 25" edc:when="(field &amp; 0x7F) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="MUL_26" edc:desc="PLL Multiply by 26" edc:when="(field &amp; 0x7F) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="MUL_27" edc:desc="PLL Multiply by 27" edc:when="(field &amp; 0x7F) == 0x1a"/>
              <edc:DCRFieldSemantic edc:cname="MUL_28" edc:desc="PLL Multiply by 28" edc:when="(field &amp; 0x7F) == 0x1b"/>
              <edc:DCRFieldSemantic edc:cname="MUL_29" edc:desc="PLL Multiply by 29" edc:when="(field &amp; 0x7F) == 0x1c"/>
              <edc:DCRFieldSemantic edc:cname="MUL_30" edc:desc="PLL Multiply by 30" edc:when="(field &amp; 0x7F) == 0x1d"/>
              <edc:DCRFieldSemantic edc:cname="MUL_31" edc:desc="PLL Multiply by 31" edc:when="(field &amp; 0x7F) == 0x1e"/>
              <edc:DCRFieldSemantic edc:cname="MUL_32" edc:desc="PLL Multiply by 32" edc:when="(field &amp; 0x7F) == 0x1f"/>
              <edc:DCRFieldSemantic edc:cname="MUL_33" edc:desc="PLL Multiply by 33" edc:when="(field &amp; 0x7F) == 0x20"/>
              <edc:DCRFieldSemantic edc:cname="MUL_34" edc:desc="PLL Multiply by 34" edc:when="(field &amp; 0x7F) == 0x21"/>
              <edc:DCRFieldSemantic edc:cname="MUL_35" edc:desc="PLL Multiply by 35" edc:when="(field &amp; 0x7F) == 0x22"/>
              <edc:DCRFieldSemantic edc:cname="MUL_36" edc:desc="PLL Multiply by 36" edc:when="(field &amp; 0x7F) == 0x23"/>
              <edc:DCRFieldSemantic edc:cname="MUL_37" edc:desc="PLL Multiply by 37" edc:when="(field &amp; 0x7F) == 0x24"/>
              <edc:DCRFieldSemantic edc:cname="MUL_38" edc:desc="PLL Multiply by 38" edc:when="(field &amp; 0x7F) == 0x25"/>
              <edc:DCRFieldSemantic edc:cname="MUL_39" edc:desc="PLL Multiply by 39" edc:when="(field &amp; 0x7F) == 0x26"/>
              <edc:DCRFieldSemantic edc:cname="MUL_40" edc:desc="PLL Multiply by 40" edc:when="(field &amp; 0x7F) == 0x27"/>
              <edc:DCRFieldSemantic edc:cname="MUL_41" edc:desc="PLL Multiply by 41" edc:when="(field &amp; 0x7F) == 0x28"/>
              <edc:DCRFieldSemantic edc:cname="MUL_42" edc:desc="PLL Multiply by 42" edc:when="(field &amp; 0x7F) == 0x29"/>
              <edc:DCRFieldSemantic edc:cname="MUL_43" edc:desc="PLL Multiply by 43" edc:when="(field &amp; 0x7F) == 0x2a"/>
              <edc:DCRFieldSemantic edc:cname="MUL_44" edc:desc="PLL Multiply by 44" edc:when="(field &amp; 0x7F) == 0x2b"/>
              <edc:DCRFieldSemantic edc:cname="MUL_45" edc:desc="PLL Multiply by 45" edc:when="(field &amp; 0x7F) == 0x2c"/>
              <edc:DCRFieldSemantic edc:cname="MUL_46" edc:desc="PLL Multiply by 46" edc:when="(field &amp; 0x7F) == 0x2d"/>
              <edc:DCRFieldSemantic edc:cname="MUL_47" edc:desc="PLL Multiply by 47" edc:when="(field &amp; 0x7F) == 0x2e"/>
              <edc:DCRFieldSemantic edc:cname="MUL_48" edc:desc="PLL Multiply by 48" edc:when="(field &amp; 0x7F) == 0x2f"/>
              <edc:DCRFieldSemantic edc:cname="MUL_49" edc:desc="PLL Multiply by 49" edc:when="(field &amp; 0x7F) == 0x30"/>
              <edc:DCRFieldSemantic edc:cname="MUL_50" edc:desc="PLL Multiply by 50" edc:when="(field &amp; 0x7F) == 0x31"/>
              <edc:DCRFieldSemantic edc:cname="MUL_51" edc:desc="PLL Multiply by 51" edc:when="(field &amp; 0x7F) == 0x32"/>
              <edc:DCRFieldSemantic edc:cname="MUL_52" edc:desc="PLL Multiply by 52" edc:when="(field &amp; 0x7F) == 0x33"/>
              <edc:DCRFieldSemantic edc:cname="MUL_53" edc:desc="PLL Multiply by 53" edc:when="(field &amp; 0x7F) == 0x34"/>
              <edc:DCRFieldSemantic edc:cname="MUL_54" edc:desc="PLL Multiply by 54" edc:when="(field &amp; 0x7F) == 0x35"/>
              <edc:DCRFieldSemantic edc:cname="MUL_55" edc:desc="PLL Multiply by 55" edc:when="(field &amp; 0x7F) == 0x36"/>
              <edc:DCRFieldSemantic edc:cname="MUL_56" edc:desc="PLL Multiply by 56" edc:when="(field &amp; 0x7F) == 0x37"/>
              <edc:DCRFieldSemantic edc:cname="MUL_57" edc:desc="PLL Multiply by 57" edc:when="(field &amp; 0x7F) == 0x38"/>
              <edc:DCRFieldSemantic edc:cname="MUL_58" edc:desc="PLL Multiply by 58" edc:when="(field &amp; 0x7F) == 0x39"/>
              <edc:DCRFieldSemantic edc:cname="MUL_59" edc:desc="PLL Multiply by 59" edc:when="(field &amp; 0x7F) == 0x3a"/>
              <edc:DCRFieldSemantic edc:cname="MUL_60" edc:desc="PLL Multiply by 60" edc:when="(field &amp; 0x7F) == 0x3b"/>
              <edc:DCRFieldSemantic edc:cname="MUL_61" edc:desc="PLL Multiply by 61" edc:when="(field &amp; 0x7F) == 0x3c"/>
              <edc:DCRFieldSemantic edc:cname="MUL_62" edc:desc="PLL Multiply by 62" edc:when="(field &amp; 0x7F) == 0x3d"/>
              <edc:DCRFieldSemantic edc:cname="MUL_63" edc:desc="PLL Multiply by 63" edc:when="(field &amp; 0x7F) == 0x3e"/>
              <edc:DCRFieldSemantic edc:cname="MUL_64" edc:desc="PLL Multiply by 64" edc:when="(field &amp; 0x7F) == 0x3f"/>
              <edc:DCRFieldSemantic edc:cname="MUL_65" edc:desc="PLL Multiply by 65" edc:when="(field &amp; 0x7F) == 0x40"/>
              <edc:DCRFieldSemantic edc:cname="MUL_66" edc:desc="PLL Multiply by 66" edc:when="(field &amp; 0x7F) == 0x41"/>
              <edc:DCRFieldSemantic edc:cname="MUL_67" edc:desc="PLL Multiply by 67" edc:when="(field &amp; 0x7F) == 0x42"/>
              <edc:DCRFieldSemantic edc:cname="MUL_68" edc:desc="PLL Multiply by 68" edc:when="(field &amp; 0x7F) == 0x43"/>
              <edc:DCRFieldSemantic edc:cname="MUL_69" edc:desc="PLL Multiply by 69" edc:when="(field &amp; 0x7F) == 0x44"/>
              <edc:DCRFieldSemantic edc:cname="MUL_70" edc:desc="PLL Multiply by 70" edc:when="(field &amp; 0x7F) == 0x45"/>
              <edc:DCRFieldSemantic edc:cname="MUL_71" edc:desc="PLL Multiply by 71" edc:when="(field &amp; 0x7F) == 0x46"/>
              <edc:DCRFieldSemantic edc:cname="MUL_72" edc:desc="PLL Multiply by 72" edc:when="(field &amp; 0x7F) == 0x47"/>
              <edc:DCRFieldSemantic edc:cname="MUL_73" edc:desc="PLL Multiply by 73" edc:when="(field &amp; 0x7F) == 0x48"/>
              <edc:DCRFieldSemantic edc:cname="MUL_74" edc:desc="PLL Multiply by 74" edc:when="(field &amp; 0x7F) == 0x49"/>
              <edc:DCRFieldSemantic edc:cname="MUL_75" edc:desc="PLL Multiply by 75" edc:when="(field &amp; 0x7F) == 0x4a"/>
              <edc:DCRFieldSemantic edc:cname="MUL_76" edc:desc="PLL Multiply by 76" edc:when="(field &amp; 0x7F) == 0x4b"/>
              <edc:DCRFieldSemantic edc:cname="MUL_77" edc:desc="PLL Multiply by 77" edc:when="(field &amp; 0x7F) == 0x4c"/>
              <edc:DCRFieldSemantic edc:cname="MUL_78" edc:desc="PLL Multiply by 78" edc:when="(field &amp; 0x7F) == 0x4d"/>
              <edc:DCRFieldSemantic edc:cname="MUL_79" edc:desc="PLL Multiply by 79" edc:when="(field &amp; 0x7F) == 0x4e"/>
              <edc:DCRFieldSemantic edc:cname="MUL_80" edc:desc="PLL Multiply by 80" edc:when="(field &amp; 0x7F) == 0x4f"/>
              <edc:DCRFieldSemantic edc:cname="MUL_81" edc:desc="PLL Multiply by 81" edc:when="(field &amp; 0x7F) == 0x50"/>
              <edc:DCRFieldSemantic edc:cname="MUL_82" edc:desc="PLL Multiply by 82" edc:when="(field &amp; 0x7F) == 0x51"/>
              <edc:DCRFieldSemantic edc:cname="MUL_83" edc:desc="PLL Multiply by 83" edc:when="(field &amp; 0x7F) == 0x52"/>
              <edc:DCRFieldSemantic edc:cname="MUL_84" edc:desc="PLL Multiply by 84" edc:when="(field &amp; 0x7F) == 0x53"/>
              <edc:DCRFieldSemantic edc:cname="MUL_85" edc:desc="PLL Multiply by 85" edc:when="(field &amp; 0x7F) == 0x54"/>
              <edc:DCRFieldSemantic edc:cname="MUL_86" edc:desc="PLL Multiply by 86" edc:when="(field &amp; 0x7F) == 0x55"/>
              <edc:DCRFieldSemantic edc:cname="MUL_87" edc:desc="PLL Multiply by 87" edc:when="(field &amp; 0x7F) == 0x56"/>
              <edc:DCRFieldSemantic edc:cname="MUL_88" edc:desc="PLL Multiply by 88" edc:when="(field &amp; 0x7F) == 0x57"/>
              <edc:DCRFieldSemantic edc:cname="MUL_89" edc:desc="PLL Multiply by 89" edc:when="(field &amp; 0x7F) == 0x58"/>
              <edc:DCRFieldSemantic edc:cname="MUL_90" edc:desc="PLL Multiply by 90" edc:when="(field &amp; 0x7F) == 0x59"/>
              <edc:DCRFieldSemantic edc:cname="MUL_91" edc:desc="PLL Multiply by 91" edc:when="(field &amp; 0x7F) == 0x5a"/>
              <edc:DCRFieldSemantic edc:cname="MUL_92" edc:desc="PLL Multiply by 92" edc:when="(field &amp; 0x7F) == 0x5b"/>
              <edc:DCRFieldSemantic edc:cname="MUL_93" edc:desc="PLL Multiply by 93" edc:when="(field &amp; 0x7F) == 0x5c"/>
              <edc:DCRFieldSemantic edc:cname="MUL_94" edc:desc="PLL Multiply by 94" edc:when="(field &amp; 0x7F) == 0x5d"/>
              <edc:DCRFieldSemantic edc:cname="MUL_95" edc:desc="PLL Multiply by 95" edc:when="(field &amp; 0x7F) == 0x5e"/>
              <edc:DCRFieldSemantic edc:cname="MUL_96" edc:desc="PLL Multiply by 96" edc:when="(field &amp; 0x7F) == 0x5f"/>
              <edc:DCRFieldSemantic edc:cname="MUL_97" edc:desc="PLL Multiply by 97" edc:when="(field &amp; 0x7F) == 0x60"/>
              <edc:DCRFieldSemantic edc:cname="MUL_98" edc:desc="PLL Multiply by 98" edc:when="(field &amp; 0x7F) == 0x61"/>
              <edc:DCRFieldSemantic edc:cname="MUL_99" edc:desc="PLL Multiply by 99" edc:when="(field &amp; 0x7F) == 0x62"/>
              <edc:DCRFieldSemantic edc:cname="MUL_100" edc:desc="PLL Multiply by 100" edc:when="(field &amp; 0x7F) == 0x63"/>
              <edc:DCRFieldSemantic edc:cname="MUL_101" edc:desc="PLL Multiply by 101" edc:when="(field &amp; 0x7F) == 0x64"/>
              <edc:DCRFieldSemantic edc:cname="MUL_102" edc:desc="PLL Multiply by 102" edc:when="(field &amp; 0x7F) == 0x65"/>
              <edc:DCRFieldSemantic edc:cname="MUL_103" edc:desc="PLL Multiply by 103" edc:when="(field &amp; 0x7F) == 0x66"/>
              <edc:DCRFieldSemantic edc:cname="MUL_104" edc:desc="PLL Multiply by 104" edc:when="(field &amp; 0x7F) == 0x67"/>
              <edc:DCRFieldSemantic edc:cname="MUL_105" edc:desc="PLL Multiply by 105" edc:when="(field &amp; 0x7F) == 0x68"/>
              <edc:DCRFieldSemantic edc:cname="MUL_106" edc:desc="PLL Multiply by 106" edc:when="(field &amp; 0x7F) == 0x69"/>
              <edc:DCRFieldSemantic edc:cname="MUL_107" edc:desc="PLL Multiply by 107" edc:when="(field &amp; 0x7F) == 0x6a"/>
              <edc:DCRFieldSemantic edc:cname="MUL_108" edc:desc="PLL Multiply by 108" edc:when="(field &amp; 0x7F) == 0x6b"/>
              <edc:DCRFieldSemantic edc:cname="MUL_109" edc:desc="PLL Multiply by 109" edc:when="(field &amp; 0x7F) == 0x6c"/>
              <edc:DCRFieldSemantic edc:cname="MUL_110" edc:desc="PLL Multiply by 110" edc:when="(field &amp; 0x7F) == 0x6d"/>
              <edc:DCRFieldSemantic edc:cname="MUL_111" edc:desc="PLL Multiply by 111" edc:when="(field &amp; 0x7F) == 0x6e"/>
              <edc:DCRFieldSemantic edc:cname="MUL_112" edc:desc="PLL Multiply by 112" edc:when="(field &amp; 0x7F) == 0x6f"/>
              <edc:DCRFieldSemantic edc:cname="MUL_113" edc:desc="PLL Multiply by 113" edc:when="(field &amp; 0x7F) == 0x70"/>
              <edc:DCRFieldSemantic edc:cname="MUL_114" edc:desc="PLL Multiply by 114" edc:when="(field &amp; 0x7F) == 0x71"/>
              <edc:DCRFieldSemantic edc:cname="MUL_115" edc:desc="PLL Multiply by 115" edc:when="(field &amp; 0x7F) == 0x72"/>
              <edc:DCRFieldSemantic edc:cname="MUL_116" edc:desc="PLL Multiply by 116" edc:when="(field &amp; 0x7F) == 0x73"/>
              <edc:DCRFieldSemantic edc:cname="MUL_117" edc:desc="PLL Multiply by 117" edc:when="(field &amp; 0x7F) == 0x74"/>
              <edc:DCRFieldSemantic edc:cname="MUL_118" edc:desc="PLL Multiply by 118" edc:when="(field &amp; 0x7F) == 0x75"/>
              <edc:DCRFieldSemantic edc:cname="MUL_119" edc:desc="PLL Multiply by 119" edc:when="(field &amp; 0x7F) == 0x76"/>
              <edc:DCRFieldSemantic edc:cname="MUL_120" edc:desc="PLL Multiply by 120" edc:when="(field &amp; 0x7F) == 0x77"/>
              <edc:DCRFieldSemantic edc:cname="MUL_121" edc:desc="PLL Multiply by 121" edc:when="(field &amp; 0x7F) == 0x78"/>
              <edc:DCRFieldSemantic edc:cname="MUL_122" edc:desc="PLL Multiply by 122" edc:when="(field &amp; 0x7F) == 0x79"/>
              <edc:DCRFieldSemantic edc:cname="MUL_123" edc:desc="PLL Multiply by 123" edc:when="(field &amp; 0x7F) == 0x7a"/>
              <edc:DCRFieldSemantic edc:cname="MUL_124" edc:desc="PLL Multiply by 124" edc:when="(field &amp; 0x7F) == 0x7b"/>
              <edc:DCRFieldSemantic edc:cname="MUL_125" edc:desc="PLL Multiply by 125" edc:when="(field &amp; 0x7F) == 0x7c"/>
              <edc:DCRFieldSemantic edc:cname="MUL_126" edc:desc="PLL Multiply by 126" edc:when="(field &amp; 0x7F) == 0x7d"/>
              <edc:DCRFieldSemantic edc:cname="MUL_127" edc:desc="PLL Multiply by 127" edc:when="(field &amp; 0x7F) == 0x7e"/>
              <edc:DCRFieldSemantic edc:cname="MUL_128" edc:desc="PLL Multiply by 128" edc:when="(field &amp; 0x7F) == 0x7f"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="FPLLODIV" edc:desc="System PLL Output Clock Divider" edc:mask="0x7" edc:name="FPLLODIV" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="DIV_2" edc:desc="2x Divider" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DIV_4" edc:desc="4x Divider" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DIV_8" edc:desc="8x Divider" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DIV_16" edc:desc="16x Divider" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DIV_32" edc:desc="32x Divider" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:DCRFieldDef edc:cname="UPLLFSEL" edc:desc="USB PLL Input Frequency Selection" edc:mask="0x1" edc:name="UPLLFSEL" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="FREQ_24MHZ" edc:desc="USB PLL input is 24 MHz" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="FREQ_12MHZ" edc:desc="USB PLL input is 12 MHz" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
